---
kind: property
id: P:Autodesk.Revit.DB.ShapeImporter.DefaultLengthUnit
source: html/eb2463a0-6dd7-5f34-c0ae-7125776b973f.htm
---
# Autodesk.Revit.DB.ShapeImporter.DefaultLengthUnit Property

The length unit to be used if not specified when the input is a unitless SAT file.

## Syntax (C#)
```csharp
public ImportUnit DefaultLengthUnit { get; }
```

## Remarks
If the input is a unitless SAT file then this length unit will be used as a backup.